# _*_ coding    : utf8 -*-
# _python_ 学习与练习
# 开发人员      ： YBingo
# 开发时间      ： 2020/1/23  11:47
# 文件名称      ： 02.PY
# 开发工具      ： PyCharm

# 序列切片
nba = [
    "迈克尔.乔丹",
    "比尔.拉塞尔",
    "卡里姆阿普杜勒儿",
    "维尔特.张伯伦",
    "埃尔文。约翰逊",
    "科比。布莱恩特",
    "蒂姆。邓肯",
    "勒布朗。詹姆斯",
    "拉力。波特",
    "沙奎尔。奥尼尔"
]
print( nba[ 1:5 ] )
print( nba[ 0:5:3 ] )

# 两个不同类型的序列相加
arrStr = [ "1", "2", "3", "4" ]
arrNum = [ 5, 6, 7, 8, 9 ]
print( "序列相加：", arrNum + arrStr )

# 序列的乘法运算
phone = [ "华为pro 10", "Vivo x21" ]
print( "序列的乘法运算：", phone * 3 )

# 检查元素是否为序列成员
bao4 = [ "梅", "兰", "菊", "竹" ]
print( "检查'梅'是否在序列中：", "梅" in bao4 )
print( "检查'草'是否在序列中：", "草" in bao4 )

# 序列长度
num = [ 3, 55, 4, 34, 99, 34 ]
print( "序列num长度：", len( num ) )

# 序列最大值
print( "序列num的最大值：", max( num ) )

# 序列最小值
print( "序列num的最小值：", min( num ) )

# 序列转列表
print( "序列转列表：", list( num ) )

# 序列转字符串
print( "序列转字符串：", str( num ) )

# 计算元素和
print( "计算序列元素和：", sum( num ) )
